
# State **`s3://infrahouse-aws-control-990466748045/terraform.tfstate`**
## Affected resources counts

|   Success |   🟢 Add |    Change |   🔴 Destroy |
|----------:|---------:|----------:|-------------:|
|        ✅ |        1 |         0 |            2 |
## Affected resources by action

|  Action  | Resources                                      |
|:--------:|:-----------------------------------------------|
|    🔴    | `module.cost-alert.random_string.alert-suffix` |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.cost-alert.aws_cloudwatch_metric_alarm.periodic_cost must be replaced
-/+ resource "aws_cloudwatch_metric_alarm" "periodic_cost" {
      + alarm_description                     = "Estimated daily cost."
      ~ alarm_name                            = "periodic_cost_Pb3CHg" -> "AWS daily cost" # forces replacement
      ~ arn                                   = "arn:aws:cloudwatch:us-east-1:990466748045:alarm:periodic_cost_Pb3CHg" -> (known after apply)
      ~ datapoints_to_alarm                   = 1 -> 2
      - dimensions                            = {} -> null
      + evaluate_low_sample_count_percentiles = (known after apply)
      ~ evaluation_periods                    = 1 -> 2
      ~ id                                    = "periodic_cost_Pb3CHg" -> (known after apply)
      - insufficient_data_actions             = [] -> null
      - ok_actions                            = [] -> null
      - period                                = 0 -> null
      - tags                                  = {} -> null
        # (12 unchanged attributes hidden)

      - metric_query {
          - id          = "m1" -> null
          - period      = 0 -> null
          - return_data = false -> null
            # (3 unchanged attributes hidden)

          - metric {
              - dimensions  = {
                  - "Currency" = "USD"
                } -> null
              - metric_name = "EstimatedCharges" -> null
              - namespace   = "AWS/Billing" -> null
              - period      = 86400 -> null
              - stat        = "Maximum" -> null
                # (1 unchanged attribute hidden)
            }
        }
      - metric_query {
          - expression  = "RATE(m1) * 1 * 24 * 3600" -> null
          - id          = "e1" -> null
          - label       = "Daily cost" -> null
          - period      = 0 -> null
          - return_data = true -> null
            # (1 unchanged attribute hidden)
        }
      + metric_query {
          + id          = "m1"
          + return_data = false
            # (3 unchanged attributes hidden)

          + metric {
              + dimensions  = {
                  + "Currency" = "USD"
                }
              + metric_name = "EstimatedCharges"
              + namespace   = "AWS/Billing"
              + period      = 43200
              + stat        = "Average"
                # (1 unchanged attribute hidden)
            }
        }
      + metric_query {
          + expression  = "RATE(m1) * 3600 * 24"
          + id          = "e1"
          + label       = "Estimated Cost per Day"
          + return_data = true
            # (1 unchanged attribute hidden)
        }
    }

  # module.cost-alert.random_string.alert-suffix will be destroyed
  # (because random_string.alert-suffix is not in configuration)
  - resource "random_string" "alert-suffix" {
      - id          = "Pb3CHg" -> null
      - length      = 6 -> null
      - lower       = true -> null
      - min_lower   = 0 -> null
      - min_numeric = 0 -> null
      - min_special = 0 -> null
      - min_upper   = 0 -> null
      - number      = true -> null
      - numeric     = true -> null
      - result      = "Pb3CHg" -> null
      - special     = false -> null
      - upper       = true -> null
    }

Plan: 1 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgImFkZCI6IDEsICJjaGFuZ2UiOiAwLCAiZGVzdHJveSI6IDJ9fQ==
```
</details>